org/spinors.org
#+setupfile: ./hugo_setup.org
#+hugo_slug: spinors
#+TITLE: spinors
* Definition of spinors and their relation to [[file:Clifford_algebras.org][Clifford algebras]]
** --https://en.wikipedia.org/wiki/Spinor#Terminology_in_physics
- The constructions given above, in terms of [[file:Clifford_algebras.org][Clifford algebra]] or [[file:representation_theory.org][representation theory]], can be thought of as defining [[file:spinors.org][spinors]] as geometric objects in zero-dimensional space-time. To obtain the spinors of physics, such as the Dirac spinor, one extends the construction to obtain a spin structure on 4-dimensional space-time (Minkowski space).
- Effectively, one starts with the tangent manifold of space-time, each point of which is a 4-dimensional vector space with $SO(3,1)$ symmetry, and then builds the spin group at each point. The neighborhoods of points are endowed with concepts of smoothness and differentiability: the standard construction is one of a fibre bundle, the fibers of which are affine spaces transforming under the [[file:spin_group.org][spin group]]. This is the so-called [[file:spinor_bundle.org][spinor bundle]].
*** **After constructing the [[file:fiber_bundle.org][fiber bundle]], one may then consider** [[file:dynamical_systems.org][dynamical systems]], such as the [__Dirac equation__](https://en.wikipedia.org/wiki/Dirac_equation), or the [__Weyl equation__](https://en.wikipedia.org/wiki/Weyl_equation) **on the [[file:fiber_bundle.org][fiber bundle]].** These equations (Dirac or Weyl) have solutions that are [plane waves](https://en.wikipedia.org/wiki/Plane_wave), **having symmetries characteristic of the fibers**, i.e. having the symmetries of [[file:spinors.org][spinors]], as obtained from the (zero-dimensional) [[file:Clifford_algebras.org][Clifford algebras]] / spin [[file:representation_theory.org][representation theory]] described above. Such plane-wave solutions (or other solutions) of the differential equations can then properly be called [__fermions__](https://en.wikipedia.org/wiki/Fermion); fermions have the algebraic qualities of [[file:spinors.org][spinors]]. **By general convention, the terms "fermion" and "spinor" are often used interchangeably in physics, as synonyms of one-another.** It appears that all [__fundamental particles__](https://en.wikipedia.org/wiki/Fundamental_particle) in nature that are spin-1/2 are described by the Dirac equation, with the possible exception of the [[https://en.wikipedia.org/wiki/Neutrino][neutrino]].
** 
** Summary
*** 
